uhnp/src/InformationRegisters/НастройкиИспользованияШаблоновМероприятий/НастройкиИспользованияШаблоновМероприятий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиИспользованияШаблоновМероприятий</name>
  <resources>
    <name>НазначенОсновным</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьРасписание</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>РасписаниеПовторения</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <dimensions>
    <name>Контекст</name>
    <type>
      <types>CatalogRef.Риски</types>
      <types>EnumRef.СпособыВыбораПоставщика</types>
      <types>CatalogRef.Цели</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидМероприятия</name>
    <type>
      <types>EnumRef.ВидыМероприятий</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ШаблонМероприятия</name>
    <type>
      <types>CatalogRef.ШаблоныМероприятий</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/Enums/ВидыМероприятий/ВидыМероприятий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыМероприятий</name>
  <enumValues>
    <name>КонтрольноеМероприятие</name>
  </enumValues>
  <enumValues>
    <name>Инициатива</name>
  </enumValues>
  <enumValues>
    <name>РеакцияНаРиск</name>
  </enumValues>
  <enumValues>
    <name>ЗакупочнаяПроцедура</name>
  </enumValues>
  <enumValues>
    <name>ОценкаПоставщиков</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Enums/СостоянияВыполненияКонтрольныхПроцедур/СостоянияВыполненияКонтрольныхПроцедур.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияВыполненияКонтрольныхПроцедур</name>
  <enumValues>
    <name>ВыполненоУспешно</name>
  </enumValues>
  <enumValues>
    <name>ВыполненоСОшибками</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Documents/Мероприятие/Мероприятие.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Мероприятие</name>
  <basedOn>Document.РисковоеСобытие</basedOn>
  <basedOn>Catalog.Риски</basedOn>
  <basedOn>Catalog.Цели</basedOn>
  <basedOn>Catalog.ЗакупочныеПроцедуры</basedOn>
  <registerRecords>InformationRegister.КонтекстыМероприятий</registerRecords>
  <registerRecords>AccumulationRegister.ЗатратыНаЛиквидациюРисков</registerRecords>
  <registerRecords>InformationRegister.ПрогрессСтадийМероприятий</registerRecords>
  <attributes>
    <name>ВидМероприятия</name>
    <type>
      <types>EnumRef.ВидыМероприятий</types>
    </type>
  </attributes>
  <attributes>
    <name>Контекст</name>
    <type>
      <types>CatalogRef.Риски</types>
      <types>DocumentRef.РисковоеСобытие</types>
      <types>CatalogRef.ЗакупочныеПроцедуры</types>
      <types>CatalogRef.Цели</types>
      <types>DocumentRef.КритерииОценкиПоставщиков</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеРеакции</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПлановыеЗатраты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФактическиеЗатраты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
      <types>CatalogRef.РолиКонтактныхЛиц</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипРеакцииНаРисковоеСобытие</name>
    <type>
      <types>CatalogRef.ТипРеакцииНаРисковоеСобытие</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтчетОРезультатах</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Предписания</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсполнительПредписания</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтролироватьИсполненияПредписания</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбщийПрогресс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонМероприятия</name>
    <type>
      <types>CatalogRef.ШаблоныМероприятий</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособВыбораПоставщика</name>
    <type>
      <types>EnumRef.СпособыВыбораПоставщика</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦФО</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Вложения</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОфициальногоОбъявленияЗакупки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПроизводственныйКалендарь</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизводственныйКалендарь</name>
    <type>
      <types>CatalogRef.ПроизводственныеКалендари</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьИспользоватьПроизводственныйКалендарь</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПроизводственныйКалендарь</name>
    <type>
      <types>CatalogRef.ПроизводственныеКалендари</types>
    </type>
  </attributes>
  <attributes>
    <name>РезультатВыполнения</name>
    <type>
      <types>EnumRef.СостоянияВыполненияКонтрольныхПроцедур</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Стадии</name>
    <attributes>
      <name>Действие</name>
      <type>
        <types>CatalogRef.СтадииМероприятий</types>
      </type>
    </attributes>
    <attributes>
      <name>Завершено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаИзменения</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОписаниеРеакции</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ПлановыеЗатратыСтадии</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФактическиеЗатратыСтадии</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Прогресс</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НапомнитьОСтадии</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтветственныйСтадии</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>РезюмеСтадии</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ИтогВыполнения</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ГруппаРодитель</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ГруппирующаяСтрока</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПредставлениеГруппы</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>75</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьВложения</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>ИзШаблона</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ФактическаяДлительность</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Участники</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
        <types>CatalogRef.РолиКонтактныхЛиц</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтекстыМероприятий</name>
    <attributes>
      <name>Контекст</name>
      <type>
        <types>AnyRef</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИтоговыеДокументы</name>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ИтоговыйДокумент</name>
      <type>
        <types>DocumentRef</types>
        <types>CatalogRef</types>
      </type>
    </attributes>
    <attributes>
      <name>ПредставлениеДокумента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>75</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипИтоговогоДокумента</name>
      <type>
        <types>CatalogRef.ИдентификаторыОбъектовМетаданных</types>
      </type>
    </attributes>
    <attributes>
      <name>СсылкаНаФайл</name>
      <type>
        <types>CatalogRef.МероприятиеПрисоединенныеФайлы</types>
      </type>
    </attributes>
    <attributes>
      <name>Обязательный</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторДокумента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

uhnp/src/Catalogs/УровниРиска/УровниРиска.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>УровниРиска</name>
  <predefined>
    <items>
      <name>Высокий</name>
      <description>Высокий</description>
    </items>
    <items>
      <name>Низкий</name>
      <description>Низкий</description>
    </items>
    <items>
      <name>Средний</name>
      <description>Средний</description>
    </items>
  </predefined>
</mdclass:Catalog>

uhnp/src/Catalogs/ВероятностиРисков/ВероятностиРисков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВероятностиРисков</name>
  <predefined>
    <items>
      <name>Высокая</name>
      <description>Высокая (&lt;85%)</description>
    </items>
    <items>
      <name>Низкая</name>
      <description>Низкая (&lt;40%)</description>
    </items>
    <items>
      <name>ОченьВысокая</name>
      <description>Очень высокая (>85%)</description>
    </items>
    <items>
      <name>ОченьНизкая</name>
      <description>Очень низкая (&lt;15%)</description>
    </items>
    <items>
      <name>Средняя</name>
      <description>Средняя (&lt;60%)</description>
    </items>
  </predefined>
  <attributes>
    <name>МинимальнаяВероятность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальнаяВероятность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УровеньВероятности</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

uhnp/src/Catalogs/ИнформационныеСистемыНалоговыйМониторинг/ИнформационныеСистемыНалоговыйМониторинг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ИнформационныеСистемыНалоговыйМониторинг</name>
  <attributes>
    <name>ВидИнформационнойСистемы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаличиеПерсональныхДанных</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДляНесколькихОрганизаций</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоступноНалоговомуОргану</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОрганизацияНалоговогоМониторинга</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
</mdclass:Catalog>

uhnp/src/CommonModules/РегламентированнаяОтчетностьНМ/Module.bsl
#Область ПрограммныйИнтерфейс

Процедура ПолучитьСведенияОПоказателяхРискиОрганизацииНалоговыйМониторинг(ИДРедакцииОтчета, ПоказателиОтчета, ПараметрыОтчета) Экспорт
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "Наименование"	, Истина, Ложь);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "ОКВЭД"			, Истина, Ложь);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "ОблРиск"		, Истина, Ложь);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "КодРиск"		, Истина, Ложь);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "НаимРиск"		, Истина, Ложь);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "ОписРиск"		, Истина, Ложь);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "НапрРиск"		, Истина, Ложь);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "КатегорРиск"	, Истина, Ложь);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "КодНалог"		, Истина, Ложь);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "Статья"		, Истина, Ложь);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "Пункт"			, Истина, Ложь);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "Подпункт"		, Истина, Ложь);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "Абзац"			, Истина, Ложь);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "ВероятРиск"	, Истина, Ложь);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "ПоследРиск"	, Истина, Ложь);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "УровРискОрг"	, Истина, Ложь);
КонецПроцедуры

Процедура ПолучитьСведенияОПоказателяхМатрицаРисковКП(ИДРедакцииОтчета, ПоказателиОтчета, ПараметрыОтчета) Экспорт
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "ГодНМ", Истина, Ложь);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "КодРиск", Истина, Ложь);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "НаимРиск", Истина, Ложь);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "КодКП", Истина, Ложь);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "НаимКП", Истина, Ложь);
КонецПроцедуры

Процедура ПолучитьСведенияОПоказателяхКонтрольныеПроцедуры(ИДРедакцииОтчета, ПоказателиОтчета, ПараметрыОтчета) Экспорт
	//Титульный
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "Наименование", Истина, Ложь);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "КодНО", Истина, Ложь);	
	//Лист 1
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "КодКП", Истина, Ложь);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "НаимКП", Истина, Ложь);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "ОписКП", Истина, Ложь);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "ЧастотПров", Истина, Ложь);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "ВидКонтрол", Истина, Ложь);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "УровКонтр", Истина, Ложь);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "СпособПров", Истина, Ложь);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "ОтвПодр", Истина, Ложь);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "ДокПодКП", Истина, Ложь);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "АвтЗапВыпКП", Истина, Ложь);	
	//Лист 2
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "ПризДоступИС", Истина, Ложь);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "ВидИСОрг", Истина, Ложь);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "ПризНалПД", Истина, Ложь);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "ПризНалДанДр", Истина, Ложь);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "НомерИС", Истина, Ложь);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "НаимИС", Истина, Ложь);
КонецПроцедуры

Процедура ПолучитьСведенияОПоказателяхРезультатыВыполнения(ИДРедакцииОтчета, ПоказателиОтчета, ПараметрыОтчета) Экспорт
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "КодКП", Истина, Ложь);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "НаимКП", Истина, Ложь);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "КолКПОтч", Истина, Ложь);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "КолКПОшиб", Истина, Ложь);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "КолКПНеОшиб", Истина, Ложь);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "ОбщКолДог", Истина, Ложь);
КонецПроцедуры

Процедура ЗаполнитьМатрицуРисковКП(ПараметрыОтчета, Контейнер) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкиИспользованияШаблоновМероприятий.ШаблонМероприятия.Код КАК КодКП,
		|	НастройкиИспользованияШаблоновМероприятий.ШаблонМероприятия.Наименование КАК НаимКП,
		|	НастройкиИспользованияШаблоновМероприятий.Контекст.Код КАК КодРиск,
		|	НастройкиИспользованияШаблоновМероприятий.Контекст.Наименование КАК НаимРиск
		|ИЗ
		|	РегистрСведений.НастройкиИспользованияШаблоновМероприятий КАК НастройкиИспользованияШаблоновМероприятий
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ШаблоныМероприятий КАК ШаблоныМероприятий
		|		ПО НастройкиИспользованияШаблоновМероприятий.ШаблонМероприятия = ШаблоныМероприятий.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Риски КАК Риски
		|		ПО НастройкиИспользованияШаблоновМероприятий.Контекст = Риски.Ссылка
		|ГДЕ
		|	НастройкиИспользованияШаблоновМероприятий.ШаблонМероприятия.ВидМероприятия = ЗНАЧЕНИЕ(Перечисление.ВидыМероприятий.КонтрольноеМероприятие)
		|	И НастройкиИспользованияШаблоновМероприятий.Контекст.ПометкаУдаления = ЛОЖЬ
		|	И НастройкиИспользованияШаблоновМероприятий.ШаблонМероприятия.ПометкаУдаления = ЛОЖЬ
		|	И НастройкиИспользованияШаблоновМероприятий.ШаблонМероприятия.УчитываетсяВНалоговомМониторинге
		|	И Риски.Неактуально = ЛОЖЬ
		|	И ШаблоныМероприятий.Неактуально = ЛОЖЬ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НовСтр = Контейнер.МатрицРискКП.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр, ВыборкаДетальныеЗаписи);
		НовСтр.УИД = Новый УникальныйИдентификатор();
	КонецЦикла;

КонецПроцедуры

Процедура ЗаполнитьРезультатыВыполнения(ПараметрыОтчета, Контейнер) Экспорт
	
	Год = СтроковыеФункцииКлиентСервер.СтрокаВЧисло(ПараметрыОтчета.ГодНМ);
	Период = СтроковыеФункцииКлиентСервер.СтрокаВЧисло(ПараметрыОтчета.Период);
	ДатаОкончания = Неопределено;
	ДатаНачала = Неопределено;
	Если ЗначениеЗаполнено(Год) И ЗначениеЗаполнено(Период) Тогда
		Если Период = 21 Тогда
			ДатаНачала = Дата(Год, 1, 1);
			ДатаОкончания = КонецМесяца(ДобавитьМесяц(ДатаНачала, 2));
		ИначеЕсли Период = 22 Тогда
			ДатаНачала = Дата(Год, 4, 1);
			ДатаОкончания = КонецМесяца(ДобавитьМесяц(ДатаНачала, 2));
		ИначеЕсли Период = 23 Тогда
			ДатаНачала = Дата(Год, 7, 1);
			ДатаОкончания = КонецМесяца(ДобавитьМесяц(ДатаНачала, 2));
		ИначеЕсли Период = 24 Тогда
			ДатаНачала = Дата(Год, 10, 1);
			ДатаОкончания = КонецМесяца(ДобавитьМесяц(ДатаНачала, 2));
		КонецЕсли;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ДоговорыКонтрагентов.Ссылка) КАК Договоров
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|ГДЕ
		|	ДоговорыКонтрагентов.ПометкаУдаления = ЛОЖЬ
		|	И ДоговорыКонтрагентов.Организация = &Организация
		|	И ДоговорыКонтрагентов.Дата МЕЖДУ &Дата1 И &Дата2";
	
	Запрос.УстановитьПараметр("Дата1", ДатаНачала);
	Запрос.УстановитьПараметр("Дата2", ДатаОкончания);
	Запрос.УстановитьПараметр("Организация", ПараметрыОтчета.Организация);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		ОбщКолДог = ВыборкаДетальныеЗаписи.Договоров;
	Иначе
		ОбщКолДог = 0;
	КонецЕсли;

	НалоговыйМониторингПереопределяемый.ЗаполнитьКоличествоДоговоровВРезультатахВыполнения(ОбщКолДог);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ШаблоныМероприятий.Код КАК КодКП,
		|	ШаблоныМероприятий.Наименование КАК НаимКП,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Мероприятие.Ссылка) КАК КолКПОтч,
		|	СУММА(ВЫБОР
		|			КОГДА Мероприятие.РезультатВыполнения = ЗНАЧЕНИЕ(Перечисление.СостоянияВыполненияКонтрольныхПроцедур.ВыполненоУспешно)
		|				ТОГДА 1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК КолКПНеОшиб,
		|	СУММА(ВЫБОР
		|			КОГДА Мероприятие.РезультатВыполнения = ЗНАЧЕНИЕ(Перечисление.СостоянияВыполненияКонтрольныхПроцедур.ВыполненоСОшибками)
		|				ТОГДА 1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК КолКПОшиб
		|ИЗ
		|	Документ.Мероприятие КАК Мероприятие
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ШаблоныМероприятий КАК ШаблоныМероприятий
		|		ПО Мероприятие.ШаблонМероприятия = ШаблоныМероприятий.Ссылка
		|ГДЕ
		|	ШаблоныМероприятий.ВидМероприятия = ЗНАЧЕНИЕ(Перечисление.ВидыМероприятий.КонтрольноеМероприятие)
		|	И ШаблоныМероприятий.ПометкаУдаления = ЛОЖЬ
		|	И ШаблоныМероприятий.УчитываетсяВНалоговомМониторинге
		|	И Мероприятие.Проведен
		|	И Мероприятие.Дата МЕЖДУ &Дата1 И &Дата2
		|	И Мероприятие.Организация = &Организация
		|
		|СГРУППИРОВАТЬ ПО
		|	ШаблоныМероприятий.Код,
		|	ШаблоныМероприятий.Наименование";
	
	Если ДатаОкончания = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И Мероприятие.Дата МЕЖДУ &Дата1 И &Дата2", "");
	Иначе
		Запрос.УстановитьПараметр("Дата1", ДатаНачала);
		Запрос.УстановитьПараметр("Дата2", КонецДня(ДатаОкончания));
	КонецЕсли;
	Запрос.УстановитьПараметр("Организация", ПараметрыОтчета.Организация);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НовСтр = Контейнер.РезКП.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр, ВыборкаДетальныеЗаписи);
		НовСтр.УИД = Новый УникальныйИдентификатор();
		НовСтр.ОбщКолДог = ОбщКолДог;
	КонецЦикла;

КонецПроцедуры

Процедура ЗаполнитьРискиОрганизацииНалоговыйМониторинг(ПараметрыОтчета, Контейнер) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Риски.Код КАК КодРиск,
		|	Риски.Наименование КАК НаимРиск,
		|	Риски.Описание КАК ОписРиск,
		|	Риски.НаправлениеРиска КАК НаправлениеРиска,
		|	Риски.КодНалога КАК КодНалог,
		|	Риски.СтатьяНК КАК Статья,
		|	Риски.СтатьяНКПункт КАК Пункт,
		|	Риски.СтатьяНКПодпункт КАК Подпункт,
		|	Риски.СтатьяНКАбзац КАК Абзац,
		|	Риски.ОценкаПоследствий / 1000 КАК ПоследРиск,
		|	Риски.Категория КАК КатегорРиск,
		|	Риски.УровеньРиска КАК УровеньРиска,
		|	Риски.Ссылка КАК Ссылка,
		|	Риски.Вероятность КАК Вероятность,
		|	Риски.КодОКВЭД2 КАК ОКВЭД,
		|	Риски.ОбластьРиска КАК ОблРиск
		|ИЗ
		|	Справочник.Риски КАК Риски
		|ГДЕ
		|	Риски.УчитываетсяВНалоговомМониторинге
		|	И Риски.ПометкаУдаления = ЛОЖЬ
		|	И Риски.Неактуально = ЛОЖЬ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НовСтр = Контейнер.РискОргНМ.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр, ВыборкаДетальныеЗаписи);
		НовСтр.НапрРиск = Формат(ВыборкаДетальныеЗаписи.НаправлениеРиска, "ЧГ=");
		Если ВыборкаДетальныеЗаписи.УровеньРиска = Справочники.УровниРиска.Низкий Тогда
			НовСтр.УровРискОрг = "1";
		ИначеЕсли ВыборкаДетальныеЗаписи.УровеньРиска = Справочники.УровниРиска.Средний Тогда
			НовСтр.УровРискОрг = "2";
		ИначеЕсли ВыборкаДетальныеЗаписи.УровеньРиска = Справочники.УровниРиска.Высокий Тогда
			НовСтр.УровРискОрг = "3";
		КонецЕсли;
		Если ВыборкаДетальныеЗаписи.Вероятность = Справочники.ВероятностиРисков.ОченьНизкая Тогда
			НовСтр.ВероятРиск = "01";
		ИначеЕсли ВыборкаДетальныеЗаписи.Вероятность = Справочники.ВероятностиРисков.Низкая Тогда
			НовСтр.ВероятРиск = "02";
		ИначеЕсли ВыборкаДетальныеЗаписи.Вероятность = Справочники.ВероятностиРисков.Средняя Тогда
			НовСтр.ВероятРиск = "03";
		ИначеЕсли ВыборкаДетальныеЗаписи.Вероятность = Справочники.ВероятностиРисков.Высокая Тогда
			НовСтр.ВероятРиск = "04";
		ИначеЕсли ВыборкаДетальныеЗаписи.Вероятность = Справочники.ВероятностиРисков.ОченьВысокая Тогда
			НовСтр.ВероятРиск = "05";
		КонецЕсли;
		НовСтр.УИД = Новый УникальныйИдентификатор();
	КонецЦикла;

КонецПроцедуры

Процедура ЗаполнитьКонтрольныеПроцедуры(ПараметрыОтчета, Контейнер) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ШаблоныМероприятий.Код КАК КодКП,
		|	ШаблоныМероприятий.Наименование КАК НаимКП,
		|	ШаблоныМероприятий.ЧастотаПроведения КАК ЧастотаПроведения,
		|	ШаблоныМероприятий.ВидКонтрольнойПроцедуры КАК ВидКонтрольнойПроцедуры,
		|	ШаблоныМероприятий.УровеньКонтроля КАК УровеньКонтроля,
		|	ШаблоныМероприятий.СпособПроведения КАК СпособПроведения,
		|	ВЫБОР
		|		КОГДА ШаблоныМероприятий.ПодтверждающиеДокументы
		|			ТОГДА ""1""
		|		ИНАЧЕ ""0""
		|	КОНЕЦ КАК ДокПодКП,
		|	ВЫБОР
		|		КОГДА ШаблоныМероприятий.АвтоматическаяЗаписьРезультатов
		|			ТОГДА ""1""
		|		ИНАЧЕ ""0""
		|	КОНЕЦ КАК АвтЗапВыпКП,
		|	ШаблоныМероприятий.ОтветственноеПодразделение КАК ОтвПодр,
		|	ШаблоныМероприятий.Описание КАК ОписКП,
		|	ШаблоныМероприятий.ИнформационнаяСистема.Код КАК НомерИС,
		|	ШаблоныМероприятий.ИнформационнаяСистема.Наименование КАК НаимИС,
		|	ШаблоныМероприятий.ИнформационнаяСистема.ВидИнформационнойСистемы КАК ВидИСОрг,
		|	ВЫБОР
		|		КОГДА ШаблоныМероприятий.ИнформационнаяСистема = ЗНАЧЕНИЕ(Справочник.ИнформационныеСистемыНалоговыйМониторинг.ПустаяСсылка)
		|			ТОГДА """"
		|		КОГДА ШаблоныМероприятий.ИнформационнаяСистема.НаличиеПерсональныхДанных
		|			ТОГДА ""1""
		|		ИНАЧЕ ""0""
		|	КОНЕЦ КАК ПризНалПД,
		|	ВЫБОР
		|		КОГДА ШаблоныМероприятий.ИнформационнаяСистема = ЗНАЧЕНИЕ(Справочник.ИнформационныеСистемыНалоговыйМониторинг.ПустаяСсылка)
		|			ТОГДА """"
		|		КОГДА ШаблоныМероприятий.ИнформационнаяСистема.ДляНесколькихОрганизаций
		|			ТОГДА ""1""
		|		ИНАЧЕ ""0""
		|	КОНЕЦ КАК ПризНалДанДр,
		|	ВЫБОР
		|		КОГДА ШаблоныМероприятий.ИнформационнаяСистема = ЗНАЧЕНИЕ(Справочник.ИнформационныеСистемыНалоговыйМониторинг.ПустаяСсылка)
		|			ТОГДА """"
		|		КОГДА ШаблоныМероприятий.ИнформационнаяСистема.ДоступноНалоговомуОргану = ИСТИНА
		|			ТОГДА ""1""
		|		ИНАЧЕ ""0""
		|	КОНЕЦ КАК ПризДоступИС,
		|	ШаблоныМероприятий.ИнформационнаяСистема.ОрганизацияНалоговогоМониторинга.ИНН КАК ИННЮЛ
		|ИЗ
		|	Справочник.ШаблоныМероприятий КАК ШаблоныМероприятий
		|ГДЕ
		|	ШаблоныМероприятий.ВидМероприятия = ЗНАЧЕНИЕ(Перечисление.ВидыМероприятий.КонтрольноеМероприятие)
		|	И ШаблоныМероприятий.ПометкаУдаления = ЛОЖЬ
		|	И ШаблоныМероприятий.УчитываетсяВНалоговомМониторинге
		|	И ШаблоныМероприятий.Неактуально = ЛОЖЬ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НовСтр = Контейнер.КонтрПроцНМ.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр, ВыборкаДетальныеЗаписи);
		НовСтр.ЧастотПров = Формат(ВыборкаДетальныеЗаписи.ЧастотаПроведения, "ЧН=0; ЧГ=");
		НовСтр.ВидКонтрол = Формат(ВыборкаДетальныеЗаписи.ВидКонтрольнойПроцедуры, "ЧГ=");
		НовСтр.УровКонтр = Формат(ВыборкаДетальныеЗаписи.УровеньКонтроля, "ЧГ=");
		НовСтр.СпособПров = Формат(ВыборкаДетальныеЗаписи.СпособПроведения, "ЧГ=");
		НовСтр.УИД = Новый УникальныйИдентификатор();
		НовСтр2 = Контейнер.СвИнфСист.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр2, ВыборкаДетальныеЗаписи);
		НовСтр2.УИД = Новый УникальныйИдентификатор();
		НовСтр2.УИДРодителя = НовСтр.УИД;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти
